
# Реализовать алгоритм задания случайных чисел. Без использования встроенного 
# генератора псевдослучайных чисел
from time import time

print(int(float(time())))
