#Вывести на экран числа от -N до N
nums= list(range(-10, 10)) 
print(nums) 