# Найти третью цифру числа или сообщить, что её нет
# a = input('Enter num: ' )
# if int(a) < 0 :
#         a = str(int(a) * -1)
# if int(a) >= 0:
#     if len(a) < 3 :
#         print('less')
#     else:
#         -print(a[2])


# a =  input(' ---> ')
# if a[0] == a[4] and a[1] == a[3]:
#     print(" палиндром")
# else :
#     print ('не палиндром')

# num = input('--> ')

# a = 'qweert'

# if num == num[::-1]
#     print('+')
# else:
#    

# from turtle import distance
# from turtle import distance

# Сформировать список из  N членов последовательности.
# Для N = 5: 1, -3, 9, -27, 81 и т.д.
n = int(input('N = '))
list_n  = [(lambda x: (-3) ** x)(x) for x in range(n)]
print(list_n)